Filename: /home/dev/scikit_learn_data/20news_home/20news-bydate-test/talk.religion.misc/84210
Truth category: 3 (talk.religion.misc)
Assigned cluster: 2 (god christian jesus moral say peopl koresh bibl object believ)

Raw data:
============ START RAW ==========================
From: psyrobtw@ubvmsd.cc.buffalo.edu (Robert Weiss)
Subject: Re: [rw] Is Robert Weiss the only orthodox Christian?
Organization: University at Buffalo
Lines: 86
News-Software: VAX/VMS VNEWS 1.41
Nntp-Posting-Host: ubvmsd.cc.buffalo.edu

In article <93111.074840LIBRBA@BYUVM.BITNET>, LIBRBA@BYUVM.BITNET writes...

Rick Anderson writes:

ra>   Robert, you keep making references to "orthodox" belief, and saying
ra> things like "it is held that..." (cf. "Kermit" thread).  On what
ra> exact body of theology are you drawing for what you call "orthodox?"

     "Orthodox" is a compound word. It comes from 'orthos' (straight, true, 
     right) and from 'doxa' (opinion, doctrine, teaching). I use orthodox to 
     refer to 'right teaching.' Right teaching is derived from letting God 
     speak to us through the Bible. This can be from reading simple truths 
     in the Scriptures and by using the Bible to interpret the Bible.

ra> Who is that "holds that" Luke meant what you said he meant?

     I think that it is apparent from reading the Scriptures that are
     pertinent.

     Luke 23:43 records Christ's promise to the repentant thief who hung on
     an adjacent cross: "Truly I say to you, today you will be with Me in
     paradise." But was it not until later that Christ rose from the dead
     and ascended to heaven? If Christ Himself was not in heaven until
     Sunday, how could the repentant thief have been there with Him? The
     answer lies in the location of "paradise" when Jesus died.

     Apparently paradise was not exalted to heaven until Easter Day.

     Jesus refers to it in the middle of the story of the rich man and 
     Lazarus as "Abraham's Bosom," to which the godly beggar Lazarus was
     carried by the angels after his decease (Luke 16:19-31).  Thus
     "Abraham's Bosom" referred to the place where the souls of the redeemed
     waited till the day of Christ's Resurrection.

     It was not yet lifted to heaven but it may well have been a section of 
     hades (Hebrew: Sheol), reserved for believers who had died in the faith
     but would not be admitted into the glorious presence of God in heaven
     until the price of redemption had actually been paid on Calvary; or
     even that none would precede the presence of Jesus back to glory with
     the Father.

     Doubtless it was the infernal paradise that the souls of Jesus and the
     repentant thief repaired after they each died on Friday afternoon. But
     on Sunday, after the risen Christ had first appeared to Mary Magdalene
     (John 20:17) and her two companions (Matthew 28:9), presumably He then
     took up with Him to glory all the inhabitants of infernal paradise
     (including Abraham, Lazarus, and the repentant thief). We read in
     Ephesians 4:8 concerning Christ: "Ascending on high, He led captivity
     captive; He gave gifts unto men." Verse 9 continues: "But what does `He
     ascended' mean but that He also descended to the lowest parts of the
     earth?" -i.e., to hades. Verse 10 adds: "He who descended is the same
     as He who ascended above all the heavens." Presumably He led the whole
     band of liberated captives from hades (i.e., the whole population of
     preresurrection paradise) up to the glory of heaven.

ra> Whenever your personal interpretation of Biblical passages is
ra> challenged, your only response seems to be that one needs merely to
ra> "look at the Bible" in order to see the truth, but what of those who
ra> see Biblical things differently from you?

     I think that this characterization is faulty. Whenever my 'personal 
     interpretation' is questioned, I usually give a reason.

     As for those that see things differently, please, put forward where
     there is a valid difference, and we can discuss it. 

     I seem to be seeing from you the notion that any difference in how one 
     views the Bible is somehow legitimate, except, or course, for the stuff 
     that I glean from it. Put forward a contrary view and perhaps we can 
     have a discussion on that topic. But to decry something that I put 
     forward, without putting forward something else to discuss, and to 
     dismiss what I put forward while giving credence to other alleged views
     that have yet to be put forward is simply being contentious.

ra> Are we to simply assume that you are the only one who really
ra> understands it?

     If you believe that something that I have drawn from Scripture is 
     wrong, then please, show me from Scripture where it is wrong.  Simply 
     stating that there are other views is not a proof. Show it to me from 
     Scripture and then we can go on.


=============================
Robert Weiss
psyrobtw@ubvms.cc.buffalo.edu

========== END RAW ============================

Preprocessed:
============ START PREPROCESSED =================
 robert weiss orthodox christian   news softwar
vax vms vnew   byuvm bitnet write    robert keep
make refer orthodox belief say thing like held
kermit thread exact bodi theolog draw call
orthodox  orthodox compound word come ortho
straight true right doxa opinion doctrin teach use
orthodox refer right teach right teach deriv let
god speak bibl read simpl truth scriptur use bibl
interpret bibl  hold luke meant said meant  think
appar read scriptur pertin  luke record christ
promis repent thief hung adjac cross truli say
today paradis later christ rose dead ascend heaven
christ heaven sunday could repent thief answer lie
locat paradis jesus die  appar paradis exalt
heaven easter day  jesus refer middl stori rich
man lazarus abraham bosom god beggar lazarus carri
angel deceas luke thus abraham bosom refer place
soul redeem wait till day christ resurrect  yet
lift heaven well section hade hebrew sheol reserv
believ die faith admit glorious presenc god heaven
price redempt actual paid calvari even none preced
presenc jesus back glori father  doubtless infern
paradis soul jesus repent thief repair die friday
afternoon sunday risen christ first appear mari
magdalen john two companion matthew presum took
glori inhabit infern paradis includ abraham
lazarus repent thief read ephesian concern christ
ascend high led captiv captiv gave gift unto men
vers continu ascend mean also descend lowest part
earth hade vers add descend ascend heaven presum
led whole band liber captiv hade whole popul
preresurrect paradis glori heaven  whenev person
interpret biblic passag challeng respons seem one
need mere look bibl order see truth see biblic
thing differ  think character faulti whenev person
interpret question usual give reason  see thing
differ pleas put forward valid differ discuss
seem see notion differ one view bibl somehow
legitim except cours stuff glean put forward
contrari view perhap discuss topic decri someth
put forward without put forward someth els discuss
dismiss put forward give credenc alleg view yet
put forward simpli contenti  simpli assum one
realli understand  believ someth drawn scriptur
wrong pleas show scriptur wrong simpli state view
proof show scriptur    robert weiss
========== END PREPROCESSED =====================


Feature vector (sorted, non-zero values only):
Term, Index, Value:
paradis, 6415, 0.264738669424
heaven, 4229, 0.261499804457
orthodox, 6303, 0.217465002012
christ, 1729, 0.200723151089
thief, 8865, 0.199331564828
forward, 3621, 0.197245274578
ascend, 672, 0.196570730058
scriptur, 7725, 0.193908169243
repent, 7287, 0.169506743465
lazarus, 5162, 0.164557386452
hade, 4113, 0.16059642687
captiv, 1508, 0.16059642687
bibl, 1071, 0.158889100398
abraham, 189, 0.143798775783
luke, 5386, 0.132369334712
glori, 3907, 0.131403614377
jesus, 4859, 0.117778069702
view, 9510, 0.113139874682
bosom, 1240, 0.112936806124
infern, 4626, 0.109704924302
refer, 7213, 0.106794584988
interpret, 4720, 0.102500198956
teach, 8729, 0.100818963603
robert, 7437, 0.097802723745
differ, 2633, 0.089193608364
simpli, 7967, 0.0889939414295
die, 2628, 0.0888602478979
whenev, 9722, 0.0858267086344
presenc, 6836, 0.0847533717324
discuss, 2708, 0.0835639244575
descend, 2554, 0.082819380461
weiss, 9698, 0.0815214899102
vers, 9476, 0.0799541870908
soul, 8149, 0.0795874986388
led, 5188, 0.0782070812538
presum, 6845, 0.0769468589173
god, 3926, 0.0765696461446
meant, 5598, 0.0732400683124
sunday, 8541, 0.0727802385734
biblic, 1072, 0.0719021867002
truth, 9132, 0.0673675467687
appar, 577, 0.0672126424021
read, 7135, 0.0661328427769
right, 7399, 0.066086071757
someth, 8126, 0.0639518288543
thing, 8869, 0.0593510304563
doxa, 2847, 0.0564684030619
doubtless, 2832, 0.0564684030619
decri, 2457, 0.0564684030619
byuvm, 1440, 0.0564684030619
sheol, 7876, 0.0548524621508
ephesian, 3147, 0.0548524621508
easter, 2966, 0.0548524621508
contenti, 2085, 0.0548524621508
exalt, 3256, 0.05353214229
credenc, 2223, 0.05353214229
wrong, 9869, 0.0531617845372
redempt, 7199, 0.0524158277538
faulti, 3408, 0.0524158277538
deceas, 2434, 0.0524158277538
glorious, 3909, 0.0514488321181
adjac, 268, 0.0514488321181
risen, 7415, 0.0505958815182
pertin, 6568, 0.0505958815182
inhabit, 4643, 0.0505958815182
redeem, 7196, 0.049832891207
glean, 3897, 0.049832891207
person, 6562, 0.0482551821952
kermit, 4990, 0.047932925261
gift, 3874, 0.04739625681
afternoon, 324, 0.0468966304351
dismiss, 2724, 0.0464292611743
companion, 1959, 0.0464292611743
unto, 9321, 0.0459902352377
hebrew, 4233, 0.0459902352377
lowest, 5372, 0.0455763105744
drawn, 2863, 0.0451847714316
bitnet, 1127, 0.0448133202632
believ, 1009, 0.0447267011982
resurrect, 7335, 0.0444599960381
preced, 6806, 0.0438012047924
character, 1662, 0.0434930004024
theolog, 8844, 0.0431973793521
day, 2402, 0.0429484912101
legitim, 5204, 0.0429133543172
till, 8933, 0.0426400498026
pleas, 6688, 0.0426063472632
liber, 5247, 0.0421225647008
contrari, 2100, 0.0421225647008
repair, 7285, 0.0418770594914
popul, 6745, 0.0414096902305
hung, 4441, 0.0411868507989
compound, 1983, 0.0411868507989
friday, 3690, 0.0405567396306
alleg, 422, 0.0405567396306
lift, 5264, 0.0403583242023
rose, 7481, 0.0401652004878
reserv, 7309, 0.0399770935454
paid, 6387, 0.0399770935454
band, 891, 0.0399770935454
notion, 6122, 0.0396149325772
doctrin, 2787, 0.0394404250944
rich, 7382, 0.0387816338486
proof, 6919, 0.0387816338486
passag, 6449, 0.0386258921448
mari, 5508, 0.0381778084083
deriv, 2550, 0.038034403522
challeng, 1642, 0.0378937833734
matthew, 5554, 0.0374875997158
valid, 9411, 0.037102993757
held, 4243, 0.037102993757
say, 7653, 0.036771445014
straight, 8422, 0.0367377881345
cross, 2241, 0.0367377881345
father, 3404, 0.0365041643225
middl, 5699, 0.0362778424623
angel, 509, 0.0361672798551
truli, 9127, 0.0359510933501
section, 7759, 0.0356384529967
mere, 5641, 0.035145629544
admit, 276, 0.035145629544
thread, 8890, 0.0350509653188
lie, 5258, 0.0350509653188
wait, 9611, 0.0348652702698
men, 5629, 0.0347741783756
topic, 8992, 0.0345953616334
gave, 3798, 0.0340839696831
promis, 6913, 0.0340021415796
price, 6857, 0.0336837733844
belief, 1008, 0.0336837733844
think, 8871, 0.0331713680905
faith, 3367, 0.0330148325783
vnew, 9564, 0.0329441811875
stori, 8418, 0.0327362709236
dead, 2415, 0.0322731727982
draw, 2861, 0.0321461219937
locat, 5323, 0.0320834228132
use, 9363, 0.031987238807
vms, 9563, 0.0319596298824
took, 8987, 0.0319596298824
speak, 8192, 0.031898518042
hold, 4341, 0.0316591008616
vax, 9439, 0.0316004632124
bodi, 1194, 0.0313705483429
concern, 2004, 0.0313141923378
add, 260, 0.0310930542359
simpl, 7965, 0.0308784693477
record, 7184, 0.0306188820529
carri, 1530, 0.0306188820529
usual, 9377, 0.030568062826
continu, 2092, 0.030568062826
later, 5140, 0.0303682788425
appear, 580, 0.0294445174254
exact, 3253, 0.028742491961
assum, 710, 0.0281025481909
perhap, 6540, 0.0280308475051
respons, 7323, 0.0278895413611
stuff, 8472, 0.0277509398077
today, 8964, 0.0276826212811
john, 4878, 0.0273829215429
opinion, 6266, 0.0271265510499
answer, 535, 0.0267283863713
understand, 9246, 0.0259653960601
word, 9829, 0.0259386244581
true, 9121, 0.0258325169171
christian, 1732, 0.0257020321237
state, 8342, 0.025676214948
order, 6281, 0.0255993111091
earth, 2956, 0.0252265851039
els, 3053, 0.0250353737288
news, 6031, 0.0250118234312
man, 5471, 0.0250118234312
write, 9865, 0.0249649513575
includ, 4579, 0.024918380714
place, 6657, 0.0248032477626
cours, 2190, 0.0247804392079
high, 4292, 0.0244902856627
softwar, 8103, 0.0241693301763
said, 7583, 0.0241068114274
reason, 7156, 0.0233583606222
actual, 254, 0.0232838950806
let, 5225, 0.0228699704173
mean, 5595, 0.0223796791519
question, 7032, 0.0219204879948
realli, 7150, 0.0214886857098
come, 1923, 0.0209996670752
need, 5993, 0.0194707147189
make, 5459, 0.0181631684461
look, 5341, 0.0180724190116
like, 5272, 0.0152482471849
